---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No 
> control/Rural/Rural 1979 Higheredu ManualD No Control.log
  log type:  text
 opened on:   8 Aug 2024, 12:50:28

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.16009     .13498   -1.1861  0.236    -.42464      .104461
    Bias-corrected | -.31234     .13498   -2.3140  0.021   -.576887     -.047786
            Robust | -.31234     .22886   -1.3647  0.172   -.760903       .13623
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04708     .07987   -0.5894  0.556   -.203612      .109461
    Bias-corrected | -.08159     .07987   -1.0216  0.307   -.238127      .074947
            Robust | -.08159     .11783   -0.6924  0.489   -.312529      .149349
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs() 
> kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1084        1199            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.432      66.432
       BW bias (b) |   102.874     102.874
         rho (h/b) |     0.646       0.646
        Unique obs |       388         283

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05057     .06255   -0.8086  0.419   -.173163      .072017
    Bias-corrected | -.05189     .06255   -0.8296  0.407   -.174479      .070701
            Robust | -.05189     .07487   -0.6930  0.488   -.198633      .094855
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .23589     .20073   1.1751   0.240   -.157541      .629311
    Bias-corrected |  -.0858     .20073   -0.4275  0.669   -.479229      .307622
            Robust |  -.0858     .35514   -0.2416  0.809   -.781859      .610252
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03253     .15749   0.2065   0.836   -.276154      .341207
    Bias-corrected |  .29031     .15749   1.8433   0.065   -.018369      .598992
            Robust |  .29031      .1978   1.4677   0.142   -.097376      .677998
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       354         784            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   111.584     111.584
       BW bias (b) |   183.663     183.663
         rho (h/b) |     0.608       0.608
        Unique obs |       306         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01541     .09574   0.1610   0.872   -.172224      .203051
    Bias-corrected | -.01569     .09574   -0.1639  0.870   -.203329      .171945
            Robust | -.01569     .11199   -0.1401  0.889   -.235195      .203811
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10783     .28426   0.3794   0.704     -.4493      .664967
    Bias-corrected |  .50092     .28426   1.7622   0.078   -.056216      1.05805
            Robust |  .50092     .73153   0.6847   0.494   -.932864       1.9347
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17346     .21852   0.7938   0.427   -.254841      .601756
    Bias-corrected |   .3043     .21852   1.3925   0.164   -.123998      .732598
            Robust |   .3043     .25213   1.2069   0.227   -.189859      .798458
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs() k
> ernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |        99         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    84.605      84.605
       BW bias (b) |   126.920     126.920
         rho (h/b) |     0.667       0.667
        Unique obs |       132         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0725      .1742   0.4162   0.677    -.26893      .413939
    Bias-corrected |  .05926      .1742   0.3402   0.734   -.282172      .400698
            Robust |  .05926     .20854   0.2842   0.776    -.34946      .467986
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .45042     .27283   1.6509   0.099   -.084322      .985155
    Bias-corrected | -.32456     .27283   -1.1896  0.234   -.859303      .210174
            Robust | -.32456     .35628   -0.9110  0.362   -1.02286      .373731
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12521     .23974   -0.5223  0.601   -.595094      .344674
    Bias-corrected |  .25751     .23974   1.0741   0.283   -.212376      .727392
            Robust |  .25751     .30132   0.8546   0.393   -.333067      .848082
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs() k
> ernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       178         320            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    92.371      92.371
       BW bias (b) |   161.342     161.342
         rho (h/b) |     0.573       0.573
        Unique obs |       286         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07464     .14536   -0.5135  0.608   -.359541      .210266
    Bias-corrected | -.12471     .14536   -0.8579  0.391   -.409616      .160191
            Robust | -.12471     .16754   -0.7444  0.457   -.453079      .203654
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.26677     .16338   -1.6328  0.103   -.586998      .053458
    Bias-corrected | -.34786     .16338   -2.1291  0.033   -.668084     -.027627
            Robust | -.34786     .28753   -1.2098  0.226   -.911404      .215693
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06494     .09302   -0.6981  0.485   -.247258       .11738
    Bias-corrected | -.18548     .09302   -1.9940  0.046   -.367799     -.003162
            Robust | -.18548     .14043   -1.3208  0.187   -.460718      .089757
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs() k
> ernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |       826         856            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.413      62.413
       BW bias (b) |    97.134      97.134
         rho (h/b) |     0.643       0.643
        Unique obs |       381         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05707     .07554   -0.7555  0.450   -.205127      .090985
    Bias-corrected | -.05047     .07554   -0.6681  0.504   -.198524      .097588
            Robust | -.05047     .09024   -0.5593  0.576   -.227328      .126392
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.16009     .15944   -1.0041  0.315   -.472578      .152398
    Bias-corrected | -.31234     .15944   -1.9590  0.050   -.624825      .000152
            Robust | -.31234     .25868   -1.2074  0.227   -.819343      .194669
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04708     .11115   -0.4235  0.672   -.264926      .170775
    Bias-corrected | -.08159     .11115   -0.7341  0.463   -.299441      .136261
            Robust | -.08159     .14929   -0.5465  0.585   -.374183      .211003
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs() 
> kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1265        1381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.214      74.214
       BW bias (b) |   109.549     109.549
         rho (h/b) |     0.677       0.677
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06608     .07698   -0.8584  0.391   -.216959      .084801
    Bias-corrected | -.08078     .07698   -1.0494  0.294    -.23166      .070099
            Robust | -.08078     .09075   -0.8901  0.373   -.258651      .097091
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .23589     .24859   0.9489   0.343    -.25134      .723111
    Bias-corrected |  -.0858     .24859   -0.3452  0.730   -.573029      .401422
            Robust |  -.0858     .35871   -0.2392  0.811   -.788861      .617254
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03253     .13421   0.2424   0.809   -.230519      .295573
    Bias-corrected |  .29031     .13421   2.1631   0.031    .027265      .553357
            Robust |  .29031     .20198   1.4373   0.151   -.105556      .686178
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       358         809            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   113.887     113.887
       BW bias (b) |   183.706     183.706
         rho (h/b) |     0.620       0.620
        Unique obs |       306         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01776     .07838   0.2265   0.821    -.13587      .171383
    Bias-corrected |  -.0147     .07838   -0.1875  0.851   -.168325      .138927
            Robust |  -.0147     .08981   -0.1637  0.870   -.190728      .161331
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10783     .32883   0.3279   0.743   -.536662       .75233
    Bias-corrected |  .50092     .32883   1.5233   0.128   -.143578      1.14541
            Robust |  .50092     .56037   0.8939   0.371   -.597389      1.59922
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17346     .15108   1.1481   0.251   -.122651      .469566
    Bias-corrected |   .3043     .15108   2.0142   0.044    .008191      .600408
            Robust |   .3043     .21545   1.4124   0.158   -.117977      .726576
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs() k
> ernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       113         239            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   103.580     103.580
       BW bias (b) |   144.982     144.982
         rho (h/b) |     0.714       0.714
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06859     .12039   0.5697   0.569   -.167371      .304555
    Bias-corrected |   .0495     .12039   0.4112   0.681    -.18646      .285466
            Robust |   .0495     .13651   0.3626   0.717   -.218058      .317064
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .45042     .30944   1.4556   0.146   -.156082      1.05691
    Bias-corrected | -.32456     .30944   -1.0489  0.294   -.931063      .281933
            Robust | -.32456     .44375   -0.7314  0.465    -1.1943      .545171
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12521     .22401   -0.5589  0.576   -.564263      .313843
    Bias-corrected |  .25751     .22401   1.1495   0.250   -.181545       .69656
            Robust |  .25751     .21894   1.1761   0.240   -.171613      .686628
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs() k
> ernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       237         505            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   111.343     111.343
       BW bias (b) |   178.203     178.203
         rho (h/b) |     0.625       0.625
        Unique obs |       286         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04746     .12864   -0.3690  0.712   -.299598       .20467
    Bias-corrected | -.09541     .12864   -0.7417  0.458   -.347544      .156723
            Robust | -.09541     .15179   -0.6286  0.530   -.392911       .20209
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.26677     .17167   -1.5540  0.120   -.603241      .069701
    Bias-corrected | -.34786     .17167   -2.0263  0.043   -.684327     -.011384
            Robust | -.34786     .28377   -1.2258  0.220   -.904033      .208322
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06494     .12984   -0.5002  0.617   -.319418      .189541
    Bias-corrected | -.18548     .12984   -1.4285  0.153    -.43996      .068999
            Robust | -.18548     .17093   -1.0851  0.278   -.520499      .149538
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs() k
> ernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |       848         885            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.584      64.584
       BW bias (b) |    97.521      97.521
         rho (h/b) |     0.662       0.662
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06017     .09968   -0.6036  0.546   -.255529      .135198
    Bias-corrected | -.05473     .09968   -0.5491  0.583   -.250096      .140631
            Robust | -.05473     .11987   -0.4566  0.648   -.289675       .18021
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22677     .15809   -1.4344  0.151   -.536612      .083079
    Bias-corrected |  -.6718     .15809   -4.2496  0.000   -.981649     -.361958
            Robust |  -.6718     .29779   -2.2560  0.024   -1.25546     -.088151
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05081     .08452   -0.6012  0.548   -.216459      .114838
    Bias-corrected | -.09773     .08452   -1.1564  0.248   -.263382      .067914
            Robust | -.09773     .13335   -0.7329  0.464   -.359102      .163634
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1040        1141            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.694      64.694
       BW bias (b) |   102.596     102.596
         rho (h/b) |     0.631       0.631
        Unique obs |       387         282

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04945     .06571   -0.7525  0.452   -.178243       .07935
    Bias-corrected | -.05214     .06571   -0.7934  0.428   -.180937      .076656
            Robust | -.05214     .07909   -0.6592  0.510   -.207161       .10288
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .33152     .28677   1.1561   0.248   -.230539      .893589
    Bias-corrected | -.55495     .28677   -1.9352  0.053   -1.11702      .007111
            Robust | -.55495     .73022   -0.7600  0.447   -1.98617      .876261
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01535     .18015   0.0852   0.932   -.337724      .368434
    Bias-corrected |  .37739     .18015   2.0949   0.036    .024312      .730469
            Robust |  .37739     .26226   1.4390   0.150   -.136638      .891419
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       351         789            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   112.931     112.931
       BW bias (b) |   188.028     188.028
         rho (h/b) |     0.601       0.601
        Unique obs |       305         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00924     .09991   0.0925   0.926   -.186585      .205067
    Bias-corrected | -.02208     .09991   -0.2210  0.825   -.217907      .173744
            Robust | -.02208     .11788   -0.1873  0.851    -.25312      .208957
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10876     .32867   -0.3309  0.741   -.752943      .535423
    Bias-corrected | -.18536     .32867   -0.5640  0.573   -.829546       .45882
            Robust | -.18536     .95605   -0.1939  0.846   -2.05919      1.68846
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12633      .2337   0.5406   0.589   -.331705      .584373
    Bias-corrected |  .22671      .2337   0.9701   0.332   -.231333      .684745
            Robust |  .22671     .28453   0.7968   0.426   -.330961      .784374
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        96         148            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.792      80.792
       BW bias (b) |   124.401     124.401
         rho (h/b) |     0.649       0.649
        Unique obs |       131         234

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03208     .18509   0.1733   0.862   -.330692      .394849
    Bias-corrected |  .00787     .18509   0.0425   0.966   -.354896      .370645
            Robust |  .00787     .22226   0.0354   0.972   -.427745      .443495
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.28     .58234   2.1980   0.028    .138605      2.42135
    Bias-corrected |   -.798     .58234   -1.3703  0.171   -1.93937      .343373
            Robust |   -.798     1.5755   -0.5065  0.613   -3.88591      2.28991
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12897     .29653   -0.4349  0.664   -.710159      .452213
    Bias-corrected |  .53132     .29653   1.7918   0.073   -.049865      1.11251
            Robust |  .53132     .50391   1.0544   0.292    -.45632      1.51896
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       162         282            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.667      85.667
       BW bias (b) |   150.231     150.231
         rho (h/b) |     0.570       0.570
        Unique obs |       285         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05913     .16484   -0.3587  0.720   -.382211      .263943
    Bias-corrected | -.10919     .16484   -0.6624  0.508   -.432269      .213885
            Robust | -.10919     .19465   -0.5610  0.575   -.490701      .272317
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.33755     .18069   -1.8681  0.062   -.691699      .016595
    Bias-corrected |  -.6307     .18069   -3.4905  0.000   -.984846     -.276552
            Robust |  -.6307     .32886   -1.9178  0.055   -1.27525      .013855
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06428     .09653   -0.6660  0.505    -.25347      .124904
    Bias-corrected | -.20751     .09653   -2.1498  0.032   -.396702     -.018328
            Robust | -.20751     .15226   -1.3629  0.173   -.505946      .090917
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |       805         819            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.586      61.586
       BW bias (b) |    97.454      97.454
         rho (h/b) |     0.632       0.632
        Unique obs |       380         280

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05261     .07798   -0.6746  0.500   -.205453      .100233
    Bias-corrected | -.04764     .07798   -0.6109  0.541    -.20048      .105206
            Robust | -.04764     .09359   -0.5090  0.611   -.231072      .135798
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22677     .13923   -1.6287  0.103   -.499648      .046115
    Bias-corrected |  -.6718     .13923   -4.8252  0.000   -.944685     -.398921
            Robust |  -.6718     .29184   -2.3019  0.021    -1.2438     -.099804
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05081     .11188   -0.4542  0.650   -.270089      .168468
    Bias-corrected | -.09773     .11188   -0.8736  0.382   -.317012      .121544
            Robust | -.09773     .14592   -0.6698  0.503   -.383735      .188267
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1168        1257            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.793      70.793
       BW bias (b) |   109.349     109.349
         rho (h/b) |     0.647       0.647
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06062     .07847   -0.7726  0.440   -.214419      .093173
    Bias-corrected |  -.0768     .07847   -0.9787  0.328   -.230594      .076998
            Robust |  -.0768     .09241   -0.8310  0.406   -.257919      .104323
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .33152     .25745   1.2877   0.198    -.17306       .83611
    Bias-corrected | -.55495     .25745   -2.1556  0.031   -1.05954     -.050368
            Robust | -.55495     .64227   -0.8640  0.388   -1.81378      .703876
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01535     .16783   0.0915   0.927   -.313584      .344294
    Bias-corrected |  .37739     .16783   2.2487   0.025    .048452       .70633
            Robust |  .37739     .20235   1.8651   0.062     -.0192      .773982
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       366         846            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   116.226     116.226
       BW bias (b) |   185.004     185.004
         rho (h/b) |     0.628       0.628
        Unique obs |       305         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01366     .09192   0.1486   0.882    -.16649      .193811
    Bias-corrected | -.02288     .09192   -0.2490  0.803   -.203035      .157267
            Robust | -.02288     .10797   -0.2120  0.832   -.234495      .188727
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10876     .34305   -0.3170  0.751   -.781121        .5636
    Bias-corrected | -.18536     .34305   -0.5403  0.589   -.857724      .486998
            Robust | -.18536     .50701   -0.3656  0.715   -1.17908      .808352
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12633      .1694   0.7458   0.456   -.205676      .458344
    Bias-corrected |  .22671      .1694   1.3383   0.181   -.105304      .558717
            Robust |  .22671       .199   1.1392   0.255    -.16332      .616732
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       105         211            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    96.277      96.277
       BW bias (b) |   135.116     135.116
         rho (h/b) |     0.713       0.713
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03459     .14012   0.2468   0.805   -.240045       .30922
    Bias-corrected |  .00834     .14012   0.0596   0.953   -.266288      .282977
            Robust |  .00834     .16146   0.0517   0.959   -.308117      .324806
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.28     .49915   2.5643   0.010    .301667      2.25829
    Bias-corrected |   -.798     .49915   -1.5987  0.110   -1.77631       .18031
            Robust |   -.798     1.4688   -0.5433  0.587   -3.67674      2.08074
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12897     .30372   -0.4246  0.671   -.724258      .466312
    Bias-corrected |  .53132     .30372   1.7494   0.080   -.063964      1.12661
            Robust |  .53132     .27253   1.9496   0.051   -.002836      1.06548
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       178         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    93.104      93.104
       BW bias (b) |   161.163     161.163
         rho (h/b) |     0.578       0.578
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06792     .17831   -0.3809  0.703    -.41741      .281569
    Bias-corrected | -.12248     .17831   -0.6869  0.492   -.471967      .227012
            Robust | -.12248     .21249   -0.5764  0.564   -.538953      .293998
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.33755     .17008   -1.9847  0.047   -.670897     -.004207
    Bias-corrected |  -.6307     .17008   -3.7083  0.000   -.964044     -.297354
            Robust |  -.6307     .33206   -1.8994  0.058   -1.28152      .020126
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06428     .12888   -0.4988  0.618   -.316884      .188317
    Bias-corrected | -.20751     .12888   -1.6101  0.107   -.460115      .045086
            Robust | -.20751     .17075   -1.2153  0.224   -.542185      .127156
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |       819         840            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.882      62.882
       BW bias (b) |    98.691      98.691
         rho (h/b) |     0.637       0.637
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05464     .09909   -0.5514  0.581   -.248858      .139575
    Bias-corrected |  -.0534     .09909   -0.5389  0.590   -.247615      .140818
            Robust |  -.0534     .11916   -0.4481  0.654   -.286953      .180156
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.32369     .20335   -1.5918  0.111   -.722256      .074868
    Bias-corrected | -1.4015     .20335   -6.8922  0.000   -1.80009     -1.00297
            Robust | -1.4015     .47214   -2.9685  0.003    -2.3269     -.476158
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05653     .09163   -0.6169  0.537   -.236126      .123071
    Bias-corrected |  -.1253     .09163   -1.3674  0.171   -.304899      .054298
            Robust |  -.1253     .15947   -0.7858  0.432   -.437846      .187245
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |       998        1087            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.649      62.649
       BW bias (b) |   101.685     101.685
         rho (h/b) |     0.616       0.616
        Unique obs |       386         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05009     .07075   -0.7080  0.479   -.188771      .088581
    Bias-corrected |  -.0524     .07075   -0.7406  0.459   -.191074      .086278
            Robust |  -.0524     .08573   -0.6112  0.541   -.220433      .115636
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .44387     .33365   1.3304   0.183   -.210059      1.09781
    Bias-corrected | -.65927     .33365   -1.9760  0.048    -1.3132     -.005335
            Robust | -.65927     1.0551   -0.6249  0.532   -2.72713      1.40859
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02556     .18676   0.1369   0.891   -.340477      .391599
    Bias-corrected |  .44849     .18676   2.4014   0.016    .082448      .814525
            Robust |  .44849      .2863   1.5665   0.117   -.112643      1.00962
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       352         800            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   113.183     113.183
       BW bias (b) |   188.309     188.309
         rho (h/b) |     0.601       0.601
        Unique obs |       304         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0129     .10112   0.1276   0.898   -.185292      .211101
    Bias-corrected | -.01803     .10112   -0.1783  0.858    -.21623      .180162
            Robust | -.01803      .1197   -0.1507  0.880   -.252637      .216569
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06016     .42059   -0.1430  0.886   -.884502      .764182
    Bias-corrected | -.32219     .42059   -0.7660  0.444   -1.14653      .502157
            Robust | -.32219     1.4823   -0.2173  0.828   -3.22751      2.58314
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15775     .25083   0.6289   0.529   -.333868      .649361
    Bias-corrected |  .34063     .25083   1.3580   0.174   -.150983      .832246
            Robust |  .34063     .34119   0.9984   0.318    -.32808      1.00934
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        95         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.808      80.808
       BW bias (b) |   125.638     125.638
         rho (h/b) |     0.643       0.643
        Unique obs |       130         233

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04492     .19305   0.2327   0.816   -.333442      .423291
    Bias-corrected |  .02391     .19305   0.1239   0.901   -.354454      .402279
            Robust |  .02391     .23351   0.1024   0.918   -.433749      .481574
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.28     .58234   2.1980   0.028    .138605      2.42135
    Bias-corrected |   -.798     .58234   -1.3703  0.171   -1.93937      .343373
            Robust |   -.798     1.5755   -0.5065  0.613   -3.88591      2.28991
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12897     .29653   -0.4349  0.664   -.710159      .452213
    Bias-corrected |  .53132     .29653   1.7918   0.073   -.049865      1.11251
            Robust |  .53132     .50391   1.0544   0.292    -.45632      1.51896
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       162         282            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.667      85.667
       BW bias (b) |   150.231     150.231
         rho (h/b) |     0.570       0.570
        Unique obs |       285         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05913     .16484   -0.3587  0.720   -.382211      .263943
    Bias-corrected | -.10919     .16484   -0.6624  0.508   -.432269      .213885
            Robust | -.10919     .19465   -0.5610  0.575   -.490701      .272317
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.50249     .23969   -2.0964  0.036   -.972276     -.032713
    Bias-corrected | -1.4692     .23969   -6.1296  0.000   -1.93898     -.999421
            Robust | -1.4692     .52513   -2.7978  0.005   -2.49843     -.439975
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07297     .10591   -0.6890  0.491    -.28055      .134609
    Bias-corrected | -.27519     .10591   -2.5984  0.009   -.482772     -.067613
            Robust | -.27519     .18608   -1.4789  0.139   -.639906       .08952
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |       756         764            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.129      59.129
       BW bias (b) |    96.495      96.495
         rho (h/b) |     0.613       0.613
        Unique obs |       379         279

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05531     .08538   -0.6479  0.517   -.222644      .112022
    Bias-corrected | -.04896     .08538   -0.5735  0.566   -.216293      .118374
            Robust | -.04896     .10325   -0.4742  0.635   -.251325      .153406
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.32369     .20741   -1.5607  0.119   -.730202      .082814
    Bias-corrected | -1.4015     .20741   -6.7574  0.000   -1.80804     -.995023
            Robust | -1.4015     .49423   -2.8358  0.005    -2.3702     -.432863
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05653     .12617   -0.4480  0.654   -.303825      .190769
    Bias-corrected |  -.1253     .12617   -0.9931  0.321   -.372597      .121996
            Robust |  -.1253     .19482   -0.6432  0.520   -.507137      .256536
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1106        1199            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.954      68.954
       BW bias (b) |   112.339     112.339
         rho (h/b) |     0.614       0.614
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06138      .0844   -0.7272  0.467   -.226791      .104038
    Bias-corrected | -.08161      .0844   -0.9670  0.334   -.247029      .083801
            Robust | -.08161     .09967   -0.8189  0.413   -.276961      .113732
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .44387     .31622   1.4037   0.160   -.175899      1.06365
    Bias-corrected | -.65927     .31622   -2.0849  0.037   -1.27904     -.039494
            Robust | -.65927     .98688   -0.6680  0.504   -2.59351      1.27497
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02556     .17733   0.1441   0.885   -.321997      .373119
    Bias-corrected |  .44849     .17733   2.5291   0.011    .100929      .796044
            Robust |  .44849     .23401   1.9166   0.055   -.010158      .907131
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       365         844            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   116.798     116.798
       BW bias (b) |   185.298     185.298
         rho (h/b) |     0.630       0.630
        Unique obs |       304         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01777     .09367   0.1897   0.850   -.165811       .20135
    Bias-corrected | -.01853     .09367   -0.1978  0.843   -.202107      .165054
            Robust | -.01853     .11066   -0.1674  0.867    -.23541      .198357
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06016     .48455   -0.1242  0.901   -1.00986      .889544
    Bias-corrected | -.32219     .48455   -0.6649  0.506   -1.27189      .627519
            Robust | -.32219     1.1032   -0.2920  0.770   -2.48452      1.84014
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15775     .18975   0.8313   0.406    -.21416      .529653
    Bias-corrected |  .34063     .18975   1.7951   0.073   -.031275      .712538
            Robust |  .34063     .26627   1.2793   0.201   -.181246      .862509
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       104         213            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    97.053      97.053
       BW bias (b) |   136.673     136.673
         rho (h/b) |     0.710       0.710
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04533     .14784   0.3066   0.759   -.244436      .335095
    Bias-corrected |  .02265     .14784   0.1532   0.878   -.267117      .312414
            Robust |  .02265     .17353   0.1305   0.896   -.317468      .362765
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.28     .49915   2.5643   0.010    .301667      2.25829
    Bias-corrected |   -.798     .49915   -1.5987  0.110   -1.77631       .18031
            Robust |   -.798     1.4688   -0.5433  0.587   -3.67674      2.08074
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12897     .30372   -0.4246  0.671   -.724258      .466312
    Bias-corrected |  .53132     .30372   1.7494   0.080   -.063964      1.12661
            Robust |  .53132     .27253   1.9496   0.051   -.002836      1.06548
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       178         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    93.104      93.104
       BW bias (b) |   161.163     161.163
         rho (h/b) |     0.578       0.578
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06792     .17831   -0.3809  0.703    -.41741      .281569
    Bias-corrected | -.12248     .17831   -0.6869  0.492   -.471967      .227012
            Robust | -.12248     .21249   -0.5764  0.564   -.538953      .293998
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.50249     .23998   -2.0939  0.036   -.972847     -.032141
    Bias-corrected | -1.4692     .23998   -6.1222  0.000   -1.93956      -.99885
            Robust | -1.4692     .52251   -2.8118  0.005   -2.49331     -.445098
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07297     .14708   -0.4961  0.620   -.361241      .215299
    Bias-corrected | -.27519     .14708   -1.8710  0.061   -.563463      .013077
            Robust | -.27519     .23311   -1.1805  0.238    -.73208      .181694
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |       769         776            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.832      60.832
       BW bias (b) |   100.672     100.672
         rho (h/b) |     0.604       0.604
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05745     .11091   -0.5180  0.604   -.274824       .15993
    Bias-corrected |  -.0627     .11091   -0.5654  0.572   -.280081      .154673
            Robust |  -.0627     .13408   -0.4676  0.640   -.325504      .200096
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03687     .03609   1.0217   0.307   -.033859      .107598
    Bias-corrected | -.01775     .03609   -0.4919  0.623   -.088481      .052976
            Robust | -.01775     .05174   -0.3431  0.732   -.119159      .083653
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", replace ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00961     .02497   -0.3850  0.700   -.058544      .039319
    Bias-corrected |  .03888     .02497   1.5573   0.119   -.010052      .087811
            Robust |  .03888     .03358   1.1577   0.247   -.026941        .1047
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat != ., covs() kernel(ep
> a) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |       877         969            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.319      54.319
       BW bias (b) |    88.172      88.172
         rho (h/b) |     0.616       0.616
        Unique obs |       388         283

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0155     .02141   -0.7238  0.469   -.057467      .026471
    Bias-corrected | -.01052     .02141   -0.4914  0.623    -.05249      .031448
            Robust | -.01052     .02484   -0.4236  0.672   -.059201      .038158
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18156     .14897   1.2188   0.223   -.110402       .47353
    Bias-corrected | -.01476     .14897   -0.0991  0.921   -.306729      .277203
            Robust | -.01476     .17154   -0.0861  0.931    -.35098      .321454
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00376     .09903   0.0379   0.970   -.190331      .197845
    Bias-corrected |  .14156     .09903   1.4295   0.153   -.052533      .335643
            Robust |  .14156     .13826   1.0239   0.306    -.12942      .412531
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs
> () kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       185         249            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.062      58.062
       BW bias (b) |    97.953      97.953
         rho (h/b) |     0.593       0.593
        Unique obs |       306         261

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01688     .08266   0.2042   0.838   -.145135      .178892
    Bias-corrected |   .0409     .08266   0.4947   0.621   -.121118      .202909
            Robust |   .0409     .09608   0.4257   0.670   -.147409        .2292
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21679     .19203   1.1289   0.259   -.159581      .593167
    Bias-corrected | -.25135     .19203   -1.3089  0.191   -.627725      .125023
            Robust | -.25135     .24683   -1.0183  0.309   -.735126      .232423
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01526     .11698   0.1304   0.896   -.214028      .244541
    Bias-corrected |  .08589     .11698   0.7342   0.463   -.143392      .315177
            Robust |  .08589     .17149   0.5009   0.616   -.250226      .422011
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==1, covs() kernel(epa
> ) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |        91         128            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.291      71.291
       BW bias (b) |   110.528     110.528
         rho (h/b) |     0.645       0.645
        Unique obs |       132         235

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03049     .09251   0.3295   0.742   -.150824      .211795
    Bias-corrected |  .04615     .09251   0.4989   0.618   -.135155      .227464
            Robust |  .04615     .10673   0.4324   0.665   -.163032      .255341
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .22205     .23194   0.9574   0.338   -.232538      .676641
    Bias-corrected |  .09648     .23194   0.4160   0.677   -.358114      .551065
            Robust |  .09648     .23119   0.4173   0.676   -.356641      .549593
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05318     .16016   0.3321   0.740   -.260723      .367086
    Bias-corrected |  .19063     .16016   1.1902   0.234   -.123277      .504532
            Robust |  .19063     .22457   0.8489   0.396   -.249517      .630772
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==2, covs() kernel(epa
> ) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       103         136            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.511      55.511
       BW bias (b) |   100.574     100.574
         rho (h/b) |     0.552       0.552
        Unique obs |       286         247

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0873     .13406   0.6512   0.515    -.17546      .350053
    Bias-corrected |  .12604     .13406   0.9402   0.347   -.136714      .388799
            Robust |  .12604     .15341   0.8216   0.411   -.174632      .426717
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==3, covs() kernel(epa
> ) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |      3715        3291            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03687     .04522   0.8154   0.415   -.051752      .125491
    Bias-corrected | -.01775     .04522   -0.3926  0.695   -.106375      .070869
            Robust | -.01775     .05551   -0.3198  0.749   -.126558      .091053
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", replace ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00961      .0219   -0.4389  0.661    -.05254      .033315
    Bias-corrected |  .03888      .0219   1.7751   0.076   -.004048      .081807
            Robust |  .03888     .03256   1.1939   0.233   -.024946      .102704
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat != ., covs() kernel(ep
> a) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1157        1255            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.388      69.388
       BW bias (b) |    94.862      94.862
         rho (h/b) |     0.731       0.731
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01638      .0293   -0.5592  0.576   -.073808       .04104
    Bias-corrected | -.00902      .0293   -0.3078  0.758   -.066441      .048407
            Robust | -.00902     .03058   -0.2949  0.768   -.068947      .050913
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18156     .17752   1.0228   0.306   -.166377      .529505
    Bias-corrected | -.01476     .17752   -0.0832  0.934   -.362704      .333178
            Robust | -.01476     .18416   -0.0802  0.936   -.375702      .346177
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00376     .09023   0.0416   0.967   -.173086      .180599
    Bias-corrected |  .14156     .09023   1.5689   0.117   -.035288      .318398
            Robust |  .14156     .14548   0.9730   0.331   -.143576      .426687
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs
> () kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       204         279            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.988      64.988
       BW bias (b) |    95.408      95.408
         rho (h/b) |     0.681       0.681
        Unique obs |       306         261
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00785     .09166   0.0856   0.932   -.171801      .187496
    Bias-corrected |  .04015     .09166   0.4380   0.661   -.139501      .219796
            Robust |  .04015     .10248   0.3918   0.695   -.160713      .241008
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21679     .16264   1.3329   0.183   -.101981      .535567
    Bias-corrected | -.25135     .16264   -1.5454  0.122   -.570125      .067423
            Robust | -.25135     .20577   -1.2215  0.222   -.654661      .151958
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01526     .11429   0.1335   0.894   -.208748      .239261
    Bias-corrected |  .08589     .11429   0.7515   0.452   -.138112      .309897
            Robust |  .08589     .20707   0.4148   0.678   -.319949      .491735
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==1, covs() kernel(epa
> ) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |        80         110            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.219      64.219
       BW bias (b) |   105.610     105.610
         rho (h/b) |     0.608       0.608
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01409     .09789   0.1439   0.886   -.177782      .205959
    Bias-corrected |  .02705     .09789   0.2763   0.782    -.16482      .218921
            Robust |  .02705     .11629   0.2326   0.816   -.200877      .254978
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .22205     .21664   1.0250   0.305   -.202551      .646653
    Bias-corrected |  .09648     .21664   0.4453   0.656   -.328126      .521078
            Robust |  .09648     .24214   0.3984   0.690   -.378104      .571056
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05318     .13626   0.3903   0.696   -.213892      .320255
    Bias-corrected |  .19063     .13626   1.3990   0.162   -.076446      .457701
            Robust |  .19063     .17698   1.0771   0.281   -.156256      .537511
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==2, covs() kernel(epa
> ) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |        94         117            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.578      50.578
       BW bias (b) |    92.595      92.595
         rho (h/b) |     0.546       0.546
        Unique obs |       286         247
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07984     .12664   0.6305   0.528   -.168363      .328038
    Bias-corrected |  .11803     .12664   0.9321   0.351   -.130166      .366235
            Robust |  .11803     .14303   0.8252   0.409     -.1623      .398368
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==3, covs() kernel(epa
> ) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |      3715        3291            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03025      .0445   0.6798   0.497   -.056963      .117459
    Bias-corrected |  -.0969      .0445   -2.1777  0.029    -.18411     -.009688
            Robust |  -.0969     .07832   -1.2372  0.216   -.250412      .056614
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", replace ctitle(no province no A
> ug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01511     .02724   -0.5546  0.579   -.068495       .03828
    Bias-corrected |  .03591     .02724   1.3184   0.187   -.017476      .089299
            Robust |  .03591     .04006   0.8964   0.370   -.042606      .114428
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |       865         946            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.714      54.714
       BW bias (b) |    89.947      89.947
         rho (h/b) |     0.608       0.608
        Unique obs |       387         282

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02022     .02287   -0.8841  0.377   -.065036      .024603
    Bias-corrected | -.01576     .02287   -0.6894  0.491   -.060584      .029055
            Robust | -.01576     .02696   -0.5848  0.559   -.068603      .037074
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .20562     .23492   0.8753   0.381   -.254806      .666055
    Bias-corrected | -.51433     .23492   -2.1894  0.029   -.974756     -.053895
            Robust | -.51433     .44346   -1.1598  0.246   -1.38349      .354838
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01933     .11455   -0.1688  0.866   -.243845      .205176
    Bias-corrected |  .13444     .11455   1.1737   0.241   -.090071       .35895
            Robust |  .13444     .19468   0.6906   0.490   -.247133      .516012
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       190         248            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.906      60.906
       BW bias (b) |   102.921     102.921
         rho (h/b) |     0.592       0.592
        Unique obs |       305         260

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00157     .08993   -0.0175  0.986    -.17782      .174681
    Bias-corrected |  .01966     .08993   0.2186   0.827   -.156591      .195909
            Robust |  .01966     .10681   0.1841   0.854   -.189684      .229002
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10641       .185   0.5752   0.565   -.256191      .469004
    Bias-corrected | -.83524       .185   -4.5148  0.000   -1.19784     -.472643
            Robust | -.83524     .30363   -2.7509  0.006   -1.43034     -.240138
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02408     .12013   -0.2005  0.841   -.259539      .211376
    Bias-corrected |  .00176     .12013   0.0147   0.988   -.233694       .23722
            Robust |  .00176     .17361   0.0102   0.992     -.3385      .342026
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        82         118            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.563      68.563
       BW bias (b) |   107.601     107.601
         rho (h/b) |     0.637       0.637
        Unique obs |       131         234

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00235     .09535   0.0246   0.980    -.18453      .189224
    Bias-corrected |  .01248     .09535   0.1309   0.896   -.174398      .199356
            Robust |  .01248     .11081   0.1126   0.910   -.204706      .229664
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .5482     .52374   1.0467   0.295   -.478311      1.57472
    Bias-corrected |  1.0793     .52374   2.0607   0.039    .052782      2.10581
            Robust |  1.0793     1.6272   0.6633   0.507   -2.11002      4.26861
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05007     .19591   0.2556   0.798   -.333902      .434046
    Bias-corrected |  .31786     .19591   1.6225   0.105   -.066112      .701836
            Robust |  .31786     .38109   0.8341   0.404   -.429059      1.06478
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       122         171            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.654      66.654
       BW bias (b) |   113.588     113.588
         rho (h/b) |     0.587       0.587
        Unique obs |       285         246

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07653     .13609   0.5623   0.574   -.190198      .343251
    Bias-corrected |  .09998     .13609   0.7347   0.463   -.166745      .366704
            Robust |  .09998     .16321   0.6126   0.540   -.219902      .419862
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |      3708        3275            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03025     .05033   0.6010   0.548   -.068403      .128898
    Bias-corrected |  -.0969     .05033   -1.9252  0.054    -.19555      .001751
            Robust |  -.0969     .08609   -1.1255  0.260   -.265641      .071842
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", replace ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01511     .02204   -0.6854  0.493   -.058306      .028091
    Bias-corrected |  .03591     .02204   1.6293   0.103   -.007287       .07911
            Robust |  .03591     .03365   1.0672   0.286   -.030045      .101867
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1095        1198            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.735      67.735
       BW bias (b) |    97.711      97.711
         rho (h/b) |     0.693       0.693
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0205     .02886   -0.7104  0.477   -.077057      .036057
    Bias-corrected |  -.0135     .02886   -0.4678  0.640   -.070054      .043059
            Robust |  -.0135     .03088   -0.4370  0.662   -.074029      .047034
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .20562     .26639   0.7719   0.440     -.3165      .727749
    Bias-corrected | -.51433     .26639   -1.9307  0.054   -1.03645      .007799
            Robust | -.51433     .55024   -0.9347  0.350   -1.59277      .564118
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01933     .10202   -0.1895  0.850   -.219283      .180614
    Bias-corrected |  .13444     .10202   1.3178   0.188   -.065508      .334388
            Robust |  .13444     .18936   0.7100   0.478   -.236693      .505573
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       199         272            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.859      64.859
       BW bias (b) |    99.298      99.298
         rho (h/b) |     0.653       0.653
        Unique obs |       305         260
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00578     .09699   -0.0596  0.953   -.195882      .184329
    Bias-corrected |  .02225     .09699   0.2294   0.819   -.167855      .212356
            Robust |  .02225     .11272   0.1974   0.844   -.198672      .243173
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10641     .15155   0.7021   0.483   -.190619      .403432
    Bias-corrected | -.83524     .15155   -5.5115  0.000   -1.13227     -.538215
            Robust | -.83524     .29454   -2.8357  0.005   -1.41254     -.257944
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02408     .13517   -0.1782  0.859   -.289008      .240845
    Bias-corrected |  .00176     .13517   0.0130   0.990   -.263163       .26669
            Robust |  .00176     .21766   0.0081   0.994   -.424834      .428361
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        77         102            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.144      60.144
       BW bias (b) |   106.157     106.157
         rho (h/b) |     0.567       0.567
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01246     .10141   -0.1229  0.902   -.211227      .186302
    Bias-corrected | -.00459     .10141   -0.0453  0.964   -.203359       .19417
            Robust | -.00459     .12309   -0.0373  0.970   -.245853      .236664
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .5482     .57799   0.9485   0.343   -.584637      1.68104
    Bias-corrected |  1.0793     .57799   1.8673   0.062   -.053544      2.21213
            Robust |  1.0793     1.4988   0.7201   0.471   -1.85835      4.01694
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05007     .17756   0.2820   0.778   -.297944      .398088
    Bias-corrected |  .31786     .17756   1.7901   0.073   -.030154      .665878
            Robust |  .31786     .31861   0.9977   0.318   -.306597      .942321
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       107         143            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.505      59.505
       BW bias (b) |   107.277     107.277
         rho (h/b) |     0.555       0.555
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0853     .14614   0.5837   0.559   -.201132      .371734
    Bias-corrected |  .12006     .14614   0.8215   0.411   -.166377      .406488
            Robust |  .12006     .17074   0.7032   0.482   -.214581      .454691
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |      3708        3275            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0392     .06312   0.6210   0.535   -.084519      .162921
    Bias-corrected | -.18013     .06312   -2.8536  0.004   -.303847     -.056407
            Robust | -.18013     .14378   -1.2528  0.210   -.461939      .101685
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", replace ctitle(no province no J
> uly-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01769     .03051   -0.5799  0.562   -.077491      .042107
    Bias-corrected |  .04249     .03051   1.3927   0.164   -.017307      .102292
            Robust |  .04249     .05135   0.8275   0.408    -.05815      .143135
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |       885         959            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.062      56.062
       BW bias (b) |    93.719      93.719
         rho (h/b) |     0.598       0.598
        Unique obs |       386         281

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02341     .02483   -0.9427  0.346   -.072074      .025259
    Bias-corrected | -.01945     .02483   -0.7834  0.433   -.068119      .029213
            Robust | -.01945     .02967   -0.6557  0.512   -.077603      .038698
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .27848     .27984   0.9951   0.320   -.269996      .826964
    Bias-corrected | -.61702     .27984   -2.2049  0.027    -1.1655     -.068537
            Robust | -.61702       .723   -0.8534  0.393   -2.03407      .800032
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01353      .1198   -0.1130  0.910   -.248341      .221275
    Bias-corrected |  .16716      .1198   1.3953   0.163   -.067647      .401969
            Robust |  .16716     .21931   0.7622   0.446   -.262669      .596992
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       193         255            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.488      61.488
       BW bias (b) |   104.656     104.656
         rho (h/b) |     0.588       0.588
        Unique obs |       304         259

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00305     .09226   0.0330   0.974   -.177788      .183883
    Bias-corrected |  .02446     .09226   0.2651   0.791   -.156375      .205295
            Robust |  .02446      .1099   0.2226   0.824    -.19094       .23986
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11539     .22391   0.5154   0.606   -.323451      .554241
    Bias-corrected | -1.4675     .22391   -6.5541  0.000   -1.90633     -1.02864
            Robust | -1.4675     .56687   -2.5888  0.010   -2.57852     -.356449
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02058     .13137   -0.1566  0.876   -.278065      .236912
    Bias-corrected |  .01492     .13137   0.1136   0.910   -.242564      .272413
            Robust |  .01492     .20857   0.0716   0.943   -.393865      .423714
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        83         116            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.139      69.139
       BW bias (b) |   109.931     109.931
         rho (h/b) |     0.629       0.629
        Unique obs |       130         233

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00945     .10132   0.0933   0.926   -.189142      .208044
    Bias-corrected |  .02173     .10132   0.2145   0.830   -.176858      .220328
            Robust |  .02173     .11882   0.1829   0.855   -.211157      .254626
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .5482     .52374   1.0467   0.295   -.478311      1.57472
    Bias-corrected |  1.0793     .52374   2.0607   0.039    .052782      2.10581
            Robust |  1.0793     1.6272   0.6633   0.507   -2.11002      4.26861
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05007     .19591   0.2556   0.798   -.333902      .434046
    Bias-corrected |  .31786     .19591   1.6225   0.105   -.066112      .701836
            Robust |  .31786     .38109   0.8341   0.404   -.429059      1.06478
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       122         171            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.654      66.654
       BW bias (b) |   113.588     113.588
         rho (h/b) |     0.587       0.587
        Unique obs |       285         246

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07653     .13609   0.5623   0.574   -.190198      .343251
    Bias-corrected |  .09998     .13609   0.7347   0.463   -.166745      .366704
            Robust |  .09998     .16321   0.6126   0.540   -.219902      .419862
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |      3693        3261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0392     .07116   0.5509   0.582   -.100269      .178671
    Bias-corrected | -.18013     .07116   -2.5313  0.011   -.319597     -.040657
            Robust | -.18013      .1685   -1.0690  0.285   -.510381      .150127
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", replace ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01769     .02475   -0.7148  0.475   -.066201      .030817
    Bias-corrected |  .04249     .02475   1.7169   0.086   -.006016      .091002
            Robust |  .04249     .04302   0.9877   0.323   -.041827      .126812
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1079        1182            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.685      67.685
       BW bias (b) |   100.194     100.194
         rho (h/b) |     0.676       0.676
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02259     .03109   -0.7265  0.468   -.083535      .038355
    Bias-corrected | -.01557     .03109   -0.5007  0.617   -.076512      .045377
            Robust | -.01557     .03451   -0.4511  0.652   -.083211      .052076
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .27848     .30102   0.9251   0.355   -.311501      .868469
    Bias-corrected | -.61702     .30102   -2.0498  0.040     -1.207     -.027032
            Robust | -.61702     .76954   -0.8018  0.423   -2.12529      .891253
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01353     .10469   -0.1293  0.897   -.218722      .191655
    Bias-corrected |  .16716     .10469   1.5967   0.110   -.038027       .37235
            Robust |  .16716     .20328   0.8223   0.411   -.231252      .565574
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       198         270            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.307      64.307
       BW bias (b) |   100.122     100.122
         rho (h/b) |     0.642       0.642
        Unique obs |       304         259
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00083     .09855   -0.0084  0.993   -.193992      .192335
    Bias-corrected |  .02792     .09855   0.2833   0.777   -.165244      .221083
            Robust |  .02792     .11506   0.2426   0.808   -.197603      .253442
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11539     .18426   0.6263   0.531   -.245742      .476531
    Bias-corrected | -1.4675     .18426   -7.9644  0.000   -1.82862     -1.10635
            Robust | -1.4675     .62416   -2.3511  0.019   -2.69082     -.244148
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02058      .1491   -0.1380  0.890   -.312805      .271652
    Bias-corrected |  .01492      .1491   0.1001   0.920   -.277304      .307153
            Robust |  .01492     .25971   0.0575   0.954   -.494105      .523953
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        77         102            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.327      62.327
       BW bias (b) |   110.329     110.329
         rho (h/b) |     0.565       0.565
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00566     .10771   -0.0526  0.958    -.21677      .205446
    Bias-corrected |  .00496     .10771   0.0461   0.963   -.206144      .216072
            Robust |  .00496     .13081   0.0380   0.970   -.251411       .26134
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .5482     .57799   0.9485   0.343   -.584637      1.68104
    Bias-corrected |  1.0793     .57799   1.8673   0.062   -.053544      2.21213
            Robust |  1.0793     1.4988   0.7201   0.471   -1.85835      4.01694
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05007     .17756   0.2820   0.778   -.297944      .398088
    Bias-corrected |  .31786     .17756   1.7901   0.073   -.030154      .665878
            Robust |  .31786     .31861   0.9977   0.318   -.306597      .942321
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       107         143            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.505      59.505
       BW bias (b) |   107.277     107.277
         rho (h/b) |     0.555       0.555
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0853     .14614   0.5837   0.559   -.201132      .371734
    Bias-corrected |  .12006     .14614   0.8215   0.411   -.166377      .406488
            Robust |  .12006     .17074   0.7032   0.482   -.214581      .454691
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |      3693        3261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No control/Rural
> /Higheredu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision No 
> control/Rural/Rural 1979 Higheredu ManualD No Control.log
  log type:  text
 closed on:   8 Aug 2024, 12:51:33
---------------------------------------------------------------------------------------------
